START_TEXT = """
به ربات بومیلیا خوش آمدید.


ربات بومیلیا به کاربران سایت کمک می‌کند تا بتوانید از طریق تلگرام داخل سایت بومیلیا پست بزارید.



سرعت آپلود سریع تر است 
یک بک آپ از اطلاعات تلگرام خودتون دارید 
پست های شما در سرچ گوگل دیده میشود


راهنمای:
برای استفاده از ربات و آپلود پست داخل سایت ابتدا باید شما توسط ربات شناسایی بشوید پس پروفایل خودتان را بسازید


در صورتی که در سایت حساب کاربری ندارید، برای ساخت حساب کاربری از طریق دکمه‌ی ساخت حساب کاربری به صفحه ثبت‌نام سایت 
بومیلیا برید و حساب کاربری خودتان را بسازید‌! 


در صورتی که حساب کاربری در سایت بومیلیا دارید/ساختید می‌تونید جهت احراز هویت بر روی دکمه‌ی احراز هویت ضربه بزنید."""

ASK_USERNAME = """
نام کاربری حساب خود در سایت را ارسال کنید:
"""

ASK_PASSWROD = """
گذرواژه حساب خود در سایت را ارسال کنید:
جهت حفظ امنیت شما, گذرواژه ارسالی بلافاصله به صورت خودکار از صفحه گفتوگو حذف خواهد شد.
"""

LOGIN_REQUIRED = """
برای استفاده از ربات ابتدا باید وارد حساب کاربری خود در سایت بومیلیا بشوید.
برای ادامه بر روی /start ضربه بزنید.
"""


UNAUTHORIZED_FILE = """
فایل مورد نظر غیرمجاز می‌باشد.
"""

LOGGED_IN_STARTS = """
برای آپلود فایل در سایت بومیلیا, فایل مورد نظر خود را به ربات ارسال/فوروارد کنید. 
"""

LOGGED_IN_PAST = """
شما قبلا وارد اکانت کاربری خود در سایت بومیلیا شده‌اید!
"""

ASK_FILE = """
فایل مدنظر را ارسال کنید.
"""

FILE_SIZE_LIMIT = """
حجم فایل غیرمجاز می‌باشد, فایل ارسال می‌بایست حداکثر ۵۰۰ مگابایت حجم داشته باشد.
"""

NEED_FILE = """
باید فایل مدنظر را ارسال کنید, از طریق منو دوباره تلاش کنید!
"""


DOWNLOAD_ERR = """
در دانلود فایل مشکلی رخ داد, لطفا دوباره تلاش کنید.
"""

IS_UPLOADING = """
دانلود فایل تکمیل شد, در حال دریافت ساخت لینک مستقیم برای فایل ...
ممکن است ساخت لینک مستقیم دقایقی به طول بی‌انجامد, صبر باشید ...
"""

TIMEOUT = """
فرصت شما برای ارسال پاسخ به پایان رسید, دوباره برروی دکمه‌ی ورود ضربه بزنید!
"""

AUTH_FAIL = """
نام‌کاربری یا گذرواژه شما اشتباه می‌باشد, دوباره تلاش کنید!
"""


WRONG_COMMAND = """
برای آپلود فایل فایل خود راه به ربات ارسال/فوروارد فرمائید.
جهت دریافت راهنمایی بیشتر دستور /start را وارد کنید.
"""

UPLOAD_DESC = """
در صورتی که میخواهید فایل را به عنوان پکیج آپلود کنید می‌بایست فایل فشرده شود. 
آیا میخواهید فایل را به عنوان پکیج آپلود کنید؟
( لطفا فقط از طریق منو جواب را ارسال نمائید )
"""

UPLOAD_SURE = """
آیا میخواهید این فایل را داخل سایت بومیلیا آپلود کنید؟ 
( لطفا فقط از طریق منو جواب را ارسال نمائید )
"""